package chap10_heap;

/**
 * [문제 10.1] 정렬된 파일 합치기
 * 여러분에게 500개의 파일이 주어져 있다. 이 파일에는 S&P 500회사의 주식 거래 정보가 들어있다.
 * 각 거래 정보는 한 줄에 1232111, AAPL, 30, 456.12의 형태로 작성되어 있다.
 * 첫 번째 숫자(1232111)는 그날 거래를 시작한 이후 걸린 시간을 밀리세컨드로 표현한 값이다.
 * 각 파일의 각 줄은 시간 순서대로 정렬되어 있다.
 * 여러분은 500개의 파일에 나와있는 거래 정보를 시간 순서대로 정렬해서 하나의 파일로 작성하려고 한다.
 * 각 파일의 크기는 대략 5~100 메가바이트이고, 이들을 모두 합친 파일의 크기는 대략 5 기가바이트이다.
 * 내용을 간단히 하기 위해 조금 더 추상적인 형태로 문제를 제시하겠다.
 * 정렬된 시퀀스의 집합이 입력으로 주어졌을 때, 이들을 하나의 정렬된 시퀀스로 합치는 프로그램을 작성하라.
 * 예를 들어, <3, 5, 7>, <0, 6>, <0, 6, 28>이 입력으로 주어진다면, 결과는 <0, 0, 3, 5, 6, 6, 7, 28>이 된다.
 * 힌트 : 각 시퀀스의 어떤 부분이 알고리즘을 수행하는 데 중요한 역할을 하는가?
 */
public class Q1 {
    public static void main(String[] args) {
        
    }
}
