package chap5_array;

/**
 * [문제 5.3] 임의의 두 정수값 곱하기
 * 어던 애플리케이션에는 임의의 정밀도 산술 연산(arbitrary precision arithmetic)이 필요하기도 하다.
 * 이를 구현하는 한 가지 방법은 배열을 사용하는 것이다.
 * 최상위 숫자를 배열의 가장 앞에 오도록 한다. 음수를 저장하는 배열은 가장 앞자리 숫자가 음수다.
 * 예를 들어, 배열 [1, 9, 3, 7, 0, 7, 7, 2, 1]은 숫자 193707721을 뜻하고, 배열 [-7, 6, 1, 8, 3, 8, 2, 5, 7, 2, 8, 7]은 숫자 -761838257287을 뜻한다.
 * 정수를 나타내는 두 개의 문자열이 주어졌을 때, 이 둘의 곱셈 결과를 반환하는 함수를 작성하라.
 * 예를 들어, 193707721 x -761838257287 = -147573952589676412927이므로 [1, 9, 3, 7, 0, 7, 7, 2, 1]과 [-7, 6, 1, 8, 3, 8, 2, 5, 7, 2, 8, 7]이 입력으로 들어오면
 * [-1, 4, 7, 5, 7, 3, 9, 5, 2, 5, 8, 9, 6, 7, 6, 4, 1, 2, 9, 2, 7]을 반환해야한다.
 * 힌트 : 초등학생 때 배운 곱셈 연산을 그대로 적용해보자.
 */
public class Q3 {
    public static void main(String[] args) {

    }
}
